#pragma once
#include <iostream>
#include "V++.h"

внедрить хутор Русь;

беззначный цифра_необименная факториал(беззначный цифра_необименная число)
жили_были
	ежели(число <= 1)
	жили_были
		возздать 1;
	конецъ
	ежели_не_так
	жили_были
		возздать факториал(число - 1)* число;
	конецъ
конецъ

пустой здравияЖелание(письмено имя)
жили_были
	молвить << "Здравствуй будь! " << имя << прыг_скок;
конецъ

пустой загадайЧисло(цифра_окоянная исконный число)
{
	число = кудаСтрелаПолетит(10, 100);
}

царь_батюшка_главный() {
	эхЛихо();
	Внедрить_Руску_Молву;
	строка строченька = "Слався Русь!";
	молвить << строченька << прыг_скок;
	
	молвить << факториал(10) <<прыг_скок;

	здравияЖелание("Святогор");
	цифра_окоянная сколькоСделатьПироговъ;
	загадайЧисло(сколькоСделатьПироговъ);
	молвить << сколькоСделатьПироговъ << прыг_скок;
}
